cases/openfoam.org/kaplanTurbineNCC/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.org                      |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0001;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    AMI
    {
        type            zeroGradient;
    }

    AMI_slave
    {
        type            zeroGradient;
    }

    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           $internalField;
    }

    outlet 
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    kaplan
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    wall 
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
